; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v7 ?v1)
             (pred_11 ?v9 ?v12)
             (pred_9 ?v7 ?v12)
             (pred_8 ?v10 ?v7 )
	     (pred_12 ?v7)
             (pred_7 ?v5)
             (pred_1 ?v9)
             (pred_3 ?v12)
             (pred_6 ?v7)
             (pred_5 ?v9)
             (pred_2 ?v7)
             (pred_4 ))



(:action op_5
:parameters (?v6 ?v3 ?v11 ?v8)
:precondition (and (pred_7 ?v6) (pred_7 ?v3) (pred_1 ?v11) (pred_3 ?v8)
          (pred_10 ?v6 ?v3) (pred_11 ?v11 ?v8)
                   (pred_9 ?v3 ?v8) (pred_12 ?v6) 
                   (pred_6 ?v3) (pred_5 ?v11))
:effect (and  (pred_2 ?v3) (not (pred_6 ?v3))))


(:action op_4
:parameters (?v6 ?v2)
:precondition (and (pred_7 ?v6) (pred_7 ?v2)
               (pred_12 ?v6) (pred_10 ?v6 ?v2) (pred_2 ?v2))
:effect (and (pred_12 ?v2) (not (pred_12 ?v6))))

(:action op_2
:parameters (?v6 ?v11)
:precondition (and (pred_7 ?v6) (pred_1 ?v11) 
                  (pred_12 ?v6) (pred_8 ?v11 ?v6) (pred_4 ))
:effect (and (pred_5 ?v11)
   (not (pred_8 ?v11 ?v6)) (not (pred_4 ))))


(:action op_1
:parameters (?v6 ?v4 ?v13)
:precondition (and (pred_7 ?v6) (pred_1 ?v4) (pred_1 ?v13)
                  (pred_12 ?v6) (pred_5 ?v13) (pred_8 ?v4 ?v6))
:effect (and (pred_5 ?v4) (pred_8 ?v13 ?v6)
        (not (pred_5 ?v13)) (not (pred_8 ?v4 ?v6))))

(:action op_3
:parameters (?v6 ?v11)
:precondition (and (pred_7 ?v6) (pred_1 ?v11) 
                  (pred_12 ?v6) (pred_5 ?v11))
:effect (and (pred_4 ) (pred_8 ?v11 ?v6) (not (pred_5 ?v11)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_15 obj_14 obj_17 obj_09 obj_04 obj_02 obj_08 obj_19 obj_20 obj_01 obj_03 obj_05 obj_16 obj_06 obj_10
    obj_13 obj_18
    obj_12 obj_07
    )

    (:init
       (pred_4)

       (pred_7 obj_11)
       (pred_7 obj_15)
       (pred_7 obj_14)
       (pred_7 obj_17)
       (pred_7 obj_09)
       (pred_7 obj_04)
       (pred_7 obj_02)
       (pred_7 obj_08)
       (pred_7 obj_19)
       (pred_7 obj_20)
       (pred_7 obj_01)
       (pred_7 obj_03)
       (pred_7 obj_05)
       (pred_7 obj_16)
       (pred_7 obj_06)
       (pred_7 obj_10)
       (pred_3 obj_13)
       (pred_3 obj_18)
       (pred_1 obj_12)
       (pred_1 obj_07)

       (pred_10 obj_11 obj_09)
       (pred_10 obj_11 obj_15)
       (pred_10 obj_15 obj_04)
       (pred_10 obj_15 obj_14)
       (pred_10 obj_15 obj_11)
       (pred_10 obj_14 obj_02)
       (pred_10 obj_14 obj_17)
       (pred_10 obj_14 obj_15)
       (pred_10 obj_17 obj_08)
       (pred_10 obj_17 obj_14)
       (pred_10 obj_09 obj_19)
       (pred_10 obj_09 obj_04)
       (pred_10 obj_09 obj_11)
       (pred_10 obj_04 obj_20)
       (pred_10 obj_04 obj_02)
       (pred_10 obj_04 obj_15)
       (pred_10 obj_04 obj_09)
       (pred_10 obj_02 obj_01)
       (pred_10 obj_02 obj_08)
       (pred_10 obj_02 obj_14)
       (pred_10 obj_02 obj_04)
       (pred_10 obj_08 obj_03)
       (pred_10 obj_08 obj_17)
       (pred_10 obj_08 obj_02)
       (pred_10 obj_19 obj_05)
       (pred_10 obj_19 obj_20)
       (pred_10 obj_19 obj_09)
       (pred_10 obj_20 obj_16)
       (pred_10 obj_20 obj_01)
       (pred_10 obj_20 obj_04)
       (pred_10 obj_20 obj_19)
       (pred_10 obj_01 obj_06)
       (pred_10 obj_01 obj_03)
       (pred_10 obj_01 obj_02)
       (pred_10 obj_01 obj_20)
       (pred_10 obj_03 obj_10)
       (pred_10 obj_03 obj_08)
       (pred_10 obj_03 obj_01)
       (pred_10 obj_05 obj_16)
       (pred_10 obj_05 obj_19)
       (pred_10 obj_16 obj_06)
       (pred_10 obj_16 obj_20)
       (pred_10 obj_16 obj_05)
       (pred_10 obj_06 obj_10)
       (pred_10 obj_06 obj_01)
       (pred_10 obj_06 obj_16)
       (pred_10 obj_10 obj_03)
       (pred_10 obj_10 obj_06)
       (pred_6 obj_06)
       (pred_6 obj_09)
       (pred_9  obj_06 obj_13)
       (pred_9  obj_09 obj_18)
       (pred_2 obj_11)
       (pred_2 obj_15)
       (pred_2 obj_14)
       (pred_2 obj_17)
       (pred_2 obj_04)
       (pred_2 obj_02)
       (pred_2 obj_08)
       (pred_2 obj_19)
       (pred_2 obj_20)
       (pred_2 obj_01)
       (pred_2 obj_03)
       (pred_2 obj_05)
       (pred_2 obj_16)
       (pred_2 obj_10)

       (pred_11  obj_12 obj_13)
       (pred_11  obj_07 obj_18)
       (pred_8 obj_12 obj_19)
       (pred_8 obj_07 obj_02)
       (pred_12 obj_03)
    )

    (:goal (and
       (pred_8 obj_12 obj_04)
    ))
(:constraints
  (always (not (pred_12 obj_01)))
)
)

; plan
1. (op_4 obj_03 obj_08)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_08)
   goals met: 0 of 1
2. (op_4 obj_08 obj_02)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_02)
   goals met: 0 of 1
3. (op_2 obj_02 obj_07)
   deleted: (pred_8 obj_07 obj_02) (pred_4)
   added: (pred_5 obj_07)
   goals met: 0 of 1
4. (op_4 obj_02 obj_04)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_04)
   goals met: 0 of 1
5. (op_3 obj_04 obj_07)
   deleted: (pred_5 obj_07)
   added: (pred_4) (pred_8 obj_07 obj_04)
   goals met: 0 of 1
6. (op_4 obj_04 obj_20)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_20)
   goals met: 0 of 1
7. (op_4 obj_20 obj_19)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_19)
   goals met: 0 of 1
8. (op_2 obj_19 obj_12)
   deleted: (pred_8 obj_12 obj_19) (pred_4)
   added: (pred_5 obj_12)
   goals met: 0 of 1
9. (op_4 obj_19 obj_20)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_20)
   goals met: 0 of 1
10. (op_4 obj_20 obj_04)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_04)
   goals met: 0 of 1
11. (op_1 obj_04 obj_07 obj_12)
   deleted: (pred_5 obj_12) (pred_8 obj_07 obj_04)
   added: (pred_5 obj_07) (pred_8 obj_12 obj_04)
   goals met: 1 of 1
